In [1]:
## Importing Important Libraries

import pandas as pd
import selenium
from selenium import webdriver
from selenium.webdriver.common.by import By
import warnings
warnings.filterwarnings('ignore')
import time

In [2]:
# Path of ChromeDriver

driver = webdriver.Chrome(r"C:\Program Files (x86)\chromedriver.exe")

In [3]:
# Getting on Website of Naukri.com

driver.get("https://www.naukri.com/")

In [5]:
# Typing Data Analyst on Search Skill Box

designation = driver.find_element(By.XPATH,'/html/body/div[1]/div[7]/div/div/div[1]/div/div/div/div[1]/div/input')
designation.send_keys('Data Analyst')

In [6]:
# Typing Bangalore on the select Location Box

location = driver.find_element(By.XPATH,'/html/body/div[1]/div[7]/div/div/div[5]/div/div/div/div[1]/div/input')
location.send_keys('Bangalore')

In [7]:
# Searching for the field Data Analyst and location Bangalore by clicking on Search button 

search = driver.find_element(By.XPATH,'/html/body/div[1]/div[7]/div/div/div[6]')
search.click()

In [8]:
# Scraping Job Titles on the webpage

job_titles = []

title_tags = driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in title_tags[0:10]:
    titles = i.text
    job_titles.append(titles)
    
    
job_titles

['Data Engineer/Data Analyst',
 'Data Analyst',
 'Data Analyst',
 'Data Analyst - Contractual',
 'Data Analyst - Contractual',
 'ExcelHER-Data Analyst',
 'Data Analyst',
 'Data Analyst',
 'Data Analyst - EdTech',
 'Data Analyst - MySQL']

In [9]:
# Scraping Job Location on the Webpage

job_location = []

location_tags = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in location_tags[0:10]:
    location = i.text
    job_location.append(location)
    
job_location

['Hybrid - Bangalore/Bengaluru, Kolkata, Hyderabad/Secunderabad, Pune, Chennai, Delhi / NCR, Mumbai (All Areas)',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru, Kolkata, Mumbai, New Delhi, Hyderabad/Secunderabad, Pune, Chennai',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru']

In [10]:
# Scraping Company Name data from the webpage

company_name = []

company_tags = driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company = i.text
    company_name.append(company)
    
company_name

['Tech Mahindra',
 'Ingersoll Rand',
 'Unusual Hire',
 'Search Advisers Services Guj',
 'Search Advisers Services Guj',
 'Volvo Financial Services',
 'Clarivate',
 'Novel Office',
 'Talentstack',
 'Talentstack']

In [11]:
# Scraping Experience Required data from the Webpage

experience_required = []

experience_tags = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for i in experience_tags[0:10]:
    experience = i.text
    experience_required.append(experience)

    
    
experience_required

['6-11 Yrs',
 '3-6 Yrs',
 '1-4 Yrs',
 '2-3 Yrs',
 '2-3 Yrs',
 '3-5 Yrs',
 '2-4 Yrs',
 '0-2 Yrs',
 '2-6 Yrs',
 '2-7 Yrs']

In [12]:
print(len(job_titles),len(job_location),len(company_name),len(experience_required))

10 10 10 10

In [13]:
df = pd.DataFrame({'Job Title':job_titles,
                  'Job Location':job_location,
                  'Company Name':company_name,
                  'Experience Required': experience_required})
df

,Job Title,Job Location,Company Name,Experience Required
0,Data Engineer/Data Analyst,"Hybrid - Bangalore/Bengaluru, Kolkata, Hyderab...",Tech Mahindra,6-11 Yrs
1,Data Analyst,Bangalore/Bengaluru,Ingersoll Rand,3-6 Yrs
2,Data Analyst,Bangalore/Bengaluru,Unusual Hire,1-4 Yrs
3,Data Analyst - Contractual,Bangalore/Bengaluru,Search Advisers Services Guj,2-3 Yrs
4,Data Analyst - Contractual,Bangalore/Bengaluru,Search Advisers Services Guj,2-3 Yrs
5,ExcelHER-Data Analyst,"Bangalore/Bengaluru, Kolkata, Mumbai, New Delh...",Volvo Financial Services,3-5 Yrs
6,Data Analyst,Bangalore/Bengaluru,Clarivate,2-4 Yrs
7,Data Analyst,Bangalore/Bengaluru,Novel Office,0-2 Yrs
8,Data Analyst - EdTech,Bangalore/Bengaluru,Talentstack,2-6 Yrs
9,Data Analyst - MySQL,Bangalore/Bengaluru,Talentstack,2-7 Yrs

## Q2. Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You  have to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data.

In [14]:
# Getting on the Webiste Naukri.com

driver.get('http://www.naukri.com/')

In [15]:
# Typing Data Scientist in the search option of Skill

designation = driver.find_element(By.XPATH,'/html/body/div[1]/div[6]/div/div/div[1]/div/div/div/div[1]/div/input')
designation.send_keys('Data Scientist')

In [16]:
# Typing Bangalore in the seach option of Job Location

location = driver.find_element(By.XPATH,'/html/body/div[1]/div[6]/div/div/div[5]/div/div/div/div[1]/div/input')
location.send_keys('Bangalore')

In [17]:
# Clicking on Search button to get the above information

search = driver.find_element(By.XPATH,'/html/body/div[1]/div[6]/div/div/div[6]')
search.click()

In [19]:
# Scraping the Job Titles data from the Webpage

job_titles = []

titles_tags = driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in titles_tags[0:10]:
    titles = i.text
    job_titles.append(titles)
    
job_titles

['Data Science Professional - IBM SPSS Statistics module',
 'Data Science Specialist',
 'Analystics & Modeling Specialist',
 'Senior data scientist',
 'Data Scientist_NLP',
 'Data Scientist',
 'Machine Learning (AI) Architect',
 'Manager - Innovations Hub - Machine Learning',
 'Data Scientist',
 'Data Scientist']

In [20]:
# Scraping the Job Location data from the Webpage using XPATH

job_location = []

location_tags = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in location_tags[0:10]:
    location = i.text
    job_location.append(location)
    
job_location

['Bangalore/Bengaluru, Noida, Mumbai, Pune, Chennai',
 'Bangalore/Bengaluru, Kolkata, Mumbai, Hyderabad/Secunderabad, Pune, Chennai',
 'Bangalore/Bengaluru, Kolkata, Mumbai, Hyderabad/Secunderabad, Pune, Chennai',
 'Bangalore/Bengaluru, Mumbai, Pune, Chennai, Gurgaon/Gurugram',
 'Bangalore/Bengaluru, Mumbai, Pune, Chennai, Gurgaon/Gurugram',
 'Bangalore/Bengaluru, Mumbai, Pune, Chennai, Gurgaon/Gurugram',
 'Bangalore/Bengaluru, Kolkata, Mumbai, New Delhi, Hyderabad/Secunderabad, Pune, Chennai',
 'Bangalore/Bengaluru, Mumbai, Hyderabad/Secunderabad',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru']

In [21]:
# Scraping Company Names from the webpage using XPATH

company_name = []

company_tags = driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company = i.text
    company_name.append(company)
    
company_name

['Hexaware Technologies',
 'Accenture',
 'Accenture',
 'Fractal Analytics',
 'Fractal Analytics',
 'Fractal Analytics',
 'Persistent',
 'PwC',
 'IBM',
 'IBM']

In [23]:
# Scraping Required Experienced Data From the Webpage

experience_required = []

experience_tags = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for i in experience_tags[0:10]:
    experience = i.text
    experience_required.append(experience)
    
experience_required

['5-8 Yrs',
 '2-4 Yrs',
 '6-8 Yrs',
 '4-8 Yrs',
 '5-11 Yrs',
 '3-7 Yrs',
 '5-12 Yrs',
 '7-9 Yrs',
 '7-9 Yrs',
 '7-11 Yrs']

In [24]:
# Getting the length of each list to execute DataFrame

print(len(job_titles),len(job_location),len(company_name),len(experience_required))

10 10 10 10

In [26]:
# Creating DataFrame

df = pd.DataFrame({'Job Title':job_titles,
                  'Job Location': job_location,
                  'Company Name': company_name,
                  'Experience Required': experience_required})

df

,Job Title,Job Location,Company Name,Experience Required
0,Data Science Professional - IBM SPSS Statistic...,"Bangalore/Bengaluru, Noida, Mumbai, Pune, Chennai",Hexaware Technologies,5-8 Yrs
1,Data Science Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture,2-4 Yrs
2,Analystics & Modeling Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture,6-8 Yrs
3,Senior data scientist,"Bangalore/Bengaluru, Mumbai, Pune, Chennai, Gu...",Fractal Analytics,4-8 Yrs
4,Data Scientist_NLP,"Bangalore/Bengaluru, Mumbai, Pune, Chennai, Gu...",Fractal Analytics,5-11 Yrs
5,Data Scientist,"Bangalore/Bengaluru, Mumbai, Pune, Chennai, Gu...",Fractal Analytics,3-7 Yrs
6,Machine Learning (AI) Architect,"Bangalore/Bengaluru, Kolkata, Mumbai, New Delh...",Persistent,5-12 Yrs
7,Manager - Innovations Hub - Machine Learning,"Bangalore/Bengaluru, Mumbai, Hyderabad/Secunde...",PwC,7-9 Yrs
8,Data Scientist,Bangalore/Bengaluru,IBM,7-9 Yrs
9,Data Scientist,Bangalore/Bengaluru,IBM,7-11 Yrs

## Q3 : In this question you have to scrape data using the filters available on the webpage as shown below:
## You have to use the location and salary filter.
## You have to scrape data for “Data Scientist” designation for first 10 job results. 
## You have to scrape the job-title, job-location, company name, experience required.
## The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs

In [27]:
# Searching Website Naukri.com

driver.get('http://www.naukri.com/')

In [28]:
# Typing Data Scientist on the search bar

designation = driver.find_element(By.XPATH,'/html/body/div[1]/div[6]/div/div/div[1]/div/div/div/div[1]/div/input')
designation.send_keys('Data Scientist')

In [29]:
# Searching for Data Scientist Role by Clicking Search Button

search = driver.find_element(By.XPATH,'/html/body/div[1]/div[6]/div/div/div[6]')
search.click()

In [31]:
# In Filter option selecting required filter

location_check_box = driver.find_element(By.XPATH,'/html/body/div[1]/div[4]/div/div/section[1]/div[2]/div[5]/div[2]/div[2]/label/i')
location_check_box.click()

In [32]:
# In Filter option selecting required salary checkbox

salary_check_box = driver.find_element(By.XPATH,'/html/body/div[1]/div[4]/div/div/section[1]/div[2]/div[6]/div[2]/div[1]/label/i')
salary_check_box.click()

In [33]:
# Creating list of Job Titles

job_titles = []

title_tags = driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in title_tags:
    title = i.text
    job_titles.append(title)
    
job_titles

['Data Scientist',
 'Junior Data Scientist',
 'Data Scientist | Business Analyst Science | Data Analyst',
 'Data Scientist | Business Analyst Science | Data Analyst',
 'ASE/SE/SSE-Data Science',
 'Modeler',
 'Business Development Manager For Recruitment Firm || 5 Days || 40 LPA']

In [34]:
# Creating List of Job Locations

job_location = []

location_tags = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in location_tags:
    location = i.text
    job_location.append(location)
    
job_location

['Temp. WFH - Kochi/Cochin, Kolkata, Hyderabad/Secunderabad, Pune, Ahmedabad, Gurgaon/Gurugram, Chennai, Coimbatore, Bangalore/Bengaluru',
 'Kolkata, Mumbai, New Delhi, Hyderabad/Secunderabad, Pune, Chennai, Bangalore/Bengaluru',
 'Delhi / NCR, Bhubaneswar, Mumbai, Hyderabad/Secunderabad, Gurgaon/Gurugram, Bangalore/Bengaluru',
 'Delhi / NCR, Rohtak, Dharuhera, Kanpur, Gurgaon/Gurugram, Bangalore/Bengaluru',
 'Noida',
 'Noida',
 'Gurgaon/Gurugram']

In [35]:
# Creating List of Company 

company_name = []

company_tags = driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags:
    company = i.text
    company_name.append(company)
    
company_name

['Cognizant',
 'Analytos',
 'Megara Infotech',
 'Megara Infotech',
 'Bold Technology Systems',
 'Resource Access Management Solutions Pvt. Ltd.',
 'Rimpac Hr Services Llp']

In [36]:
# Creating List Of Experineced Required Data

exp_req = []

exp_tags = driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for i in exp_tags:
    exp = i.text
    exp_req.append(exp)
    
exp_req

['6-10 Yrs', '0-2 Yrs', '0-1 Yrs', '0-1 Yrs', '2-7 Yrs', '3-7 Yrs', '1-6 Yrs']

In [37]:
print(len(job_titles),len(job_location),len(company_name),len(exp_req))

7 7 7 7

In [38]:
# Creating Dataframe

df = pd.DataFrame({"Job Title": job_titles,
                  "Job Location": job_location,
                  "Company Name": company_name,
                  "Experience Required": exp_req})
df

,Job Title,Job Location,Company Name,Experience Required
0,Data Scientist,"Temp. WFH - Kochi/Cochin, Kolkata, Hyderabad/S...",Cognizant,6-10 Yrs
1,Junior Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Analytos,0-2 Yrs
2,Data Scientist | Business Analyst Science | Da...,"Delhi / NCR, Bhubaneswar, Mumbai, Hyderabad/Se...",Megara Infotech,0-1 Yrs
3,Data Scientist | Business Analyst Science | Da...,"Delhi / NCR, Rohtak, Dharuhera, Kanpur, Gurgao...",Megara Infotech,0-1 Yrs
4,ASE/SE/SSE-Data Science,Noida,Bold Technology Systems,2-7 Yrs
5,Modeler,Noida,Resource Access Management Solutions Pvt. Ltd.,3-7 Yrs
6,Business Development Manager For Recruitment F...,Gurgaon/Gurugram,Rimpac Hr Services Llp,1-6 Yrs

## Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:
## 1. Brand
## 2. ProductDescription
## 3. Price

In [39]:
driver.get('http://www.flipkart.com/')

In [40]:
# Typing sunglasses on the search box

product_type = driver.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/div/input')
product_type.send_keys('sunglasses')

In [41]:
# Searching for sunglasses

search = driver.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/button')
search.click()

In [52]:
sun_brand = []
sun_desc = []
sun_price = []

for page in range(0,3):    # Going through loop of 3 pages
    brand = driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')  # Storing data of brand in list
    for i in brand:
        sun_brand.append(i.text)
        
#       
    next_button = driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]') # Clicking on next button and looping same code to extract data
    next_button.click()
    time.sleep(3)
    
    
time.sleep(3)

for page2 in range(0,3):
    desc = driver.find_elements(By.XPATH,'//a[@class="IRpwTa" or @class="IRpwTa _2-ICcC"] ')
    for i in desc:
        sun_desc.append(i.text)
        
    next_button = driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)
    
time.sleep(3)

for page3 in range(0,3):
    price = driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for i in price:
        sun_price.append(i.text)
        
    next_button = driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)
    
time.sleep(3)

In [53]:
len(sun_brand)

120

In [54]:
len(sun_desc)

120

In [55]:
len(sun_price)

120

In [56]:
df = pd.DataFrame({"Brand":sun_brand,
                  "Product Description":sun_desc,
                  "Price":sun_price})

df.head(100)

            Brand                                Product Description Price
0          Resist  Mirrored, Night Vision, UV Protection, Riding ...  ₹599
1        PROVOGUE       UV Protection Aviator Sunglasses (Free Size)  ₹445
2          ROZIOR             UV Protection Wayfarer Sunglasses (59)  ₹149
3            SRPM          Polarized Wayfarer Sunglasses (Free Size)  ₹149
4       Elligator      UV Protection Wayfarer Sunglasses (Free Size)  ₹268
..            ...                                                ...   ...
95  VINCENT CHASE  Polarized, Riding Glasses, UV Protection Wayfa...  ₹899
96      New Specs  Mirrored, UV Protection Wayfarer Sunglasses (F...  ₹264
97      Elligator  Gradient, UV Protection Wayfarer Sunglasses (F...  ₹149
98      Elligator    UV Protection, Mirrored Aviator Sunglasses (57)  ₹149
99  VINCENT CHASE      UV Protection Wayfarer Sunglasses (Free Size)  ₹979

[100 rows x 3 columns]

## Scrape 100 reviews data from flipkart.com for iphone11 phone

In [57]:
driver.get('https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&market')

In [58]:
ip_rating = []
ip_review_sum = []
ip_review_full = []


for page in range(0,10):
    rating = driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
    review_sum = driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
    review_full = driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]')
    for i in rating:
        
        ip_rating.append(i.text)
        
    for j in review_sum:
        ip_review_sum.append(j.text)
        
    for k in review_full:
        ip_review_full.append(k.text)
    
    
        
    next_button = driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)
    
    
# for page in range(0,10):
#     review_sum = driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
#     for i in review_sum:
#         ip_review_sum.append(i.text)
        
#     next_button = driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
#     next_button.click()
#     time.sleep(3)
    
# for page in range(0,10):
#     review_full = driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]')
#     for i in review_full:
#         ip_review_full.append(i.text)
        
#     next_button =

In [59]:
len(ip_rating)

100

In [60]:
len(ip_review_sum)

100

In [61]:
len(ip_review_full)

100

In [62]:
df = pd.DataFrame({"Rating":ip_rating,
                  "Review Summary":ip_review_sum,
                  "Full Review":ip_review_full})

df

,Rating,Review Summary,Full Review
0,5,Simply awesome,Really satisfied with the Product I received.....
1,5,Perfect product!,Amazing phone with great cameras and better ba...
2,5,Best in the market!,Great iPhone very snappy experience as apple k...
3,4,Value-for-money,I'm Really happy with the product\nDelivery wa...
4,5,Highly recommended,It's my first time to use iOS phone and I am l...
...,...,...,...
95,5,Worth every penny,Previously I was using one plus 3t it was a gr...
96,4,Pretty good,I was using Iphone 6s and also Oneplus 6t. Bot...
97,5,Perfect product!,Value for money\n5 star rating\nExcellent came...
98,5,Highly recommended,What a camera .....just awesome ..you can feel...
99,5,Great product,Amazing Powerful and Durable Gadget.\n\nI’m am...

## Q6 : Scrape data for first 100 sneakers you find when you visit flipkart.com and search for “sneakers” in the search field.
## You have to scrape 3 attributes of each sneaker:1. Brand 2. ProductDescription 3. Price

In [63]:
driver.get('http://www.flipkart.com/')

In [64]:
product_type = driver.find_element(By.XPATH,'/html/body/div/div/div[1]/div[1]/div[2]/div[2]/form/div/div/input')
product_type.send_keys('sneakers')

In [65]:
search = driver.find_element(By.XPATH,'/html/body/div/div/div[1]/div[1]/div[2]/div[2]/form/div/button')
search.click()

In [69]:
s_brand= []
s_desc = []
s_price = []


for page in range(0,3):
    brand = driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    desc = driver.find_elements(By.XPATH,'//a[@class="IRpwTa" or @class="IRpwTa _2-ICcC" ]')
    price = driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for i in brand:
        s_brand.append(i.text)
        
    for j in desc:
        s_desc.append(j.text)
        
    for k in price:
        s_price.append(k.text)
        
    
    next_button = driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_button.click()
    time.sleep(3)

In [70]:
len(s_brand)

120

In [71]:
len(s_desc)

120

In [72]:
len(s_price)

120

In [74]:
df = pd.DataFrame({"Brand": s_brand,
                  "Product Description":s_desc,
                  "Product Price": s_price})
df.head(100)

,Brand,Product Description,Product Price
0,BRUTON,Modern Trendy Sneakers Shoes Sneakers For Men,₹299
1,Rowlans,"comfortable,durable,sport shoe,snerakers,walki...",₹551
2,aadi,"Lightweight,Comfort,Summer,Trendy,Walking,Outd...",₹299
3,aadi,Synthetic Leather |Lightweight|Comfort|Summer|...,₹399
4,SFR,2006 Trenddy Fashion Sporty Casuals Sneakers R...,₹299
...,...,...,...
95,BIRDE,Premium Sports Shoes For Men Pack Of 2 Sneaker...,₹649
96,MACAU,Sneakers For Men,₹579
97,'Trends',Casual sneaker fashionable shoes for men Sneak...,₹399
98,Magnolia,Modern Trendy Sneakers boot Sneakers Sneakers ...,₹399
99,World Wear Footwear,Latest Collection-1215 Stylish Casual Sports S...,₹299

## Q7: Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon. Then  set CPU Type filter to “Intel Core i7” 
## After setting the filters scrape first 10 laptops data. You have to scrape 3 attributes for each laptop: 1. Title 2. Ratings 3. Price

In [84]:
driver.get('https://www.amazon.in/')

In [87]:
product = driver.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input')
product.send_keys('Laptop')

In [88]:
search = driver.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input')
search.click()

In [89]:
i7_pro = driver.find_element(By.XPATH,'/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[7]/li[9]/span/a/div/label/i')
i7_pro.click()

In [90]:
laptop_title = []
laptop_rating = []
laptop_price = []

title = driver.find_elements(By.XPATH,'//span[@class="a-size-medium a-color-base a-text-normal"]')
rating = driver.find_elements(By.XPATH,'//span[@class="a-size-base"]')
price = driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')

for i in title[0:10]:
    laptop_title.append(i.text)
    
for j in rating[0:10]:
    laptop_rating.append(j.text)
    
for k in price[0:10]:
    laptop_price.append(k.text)

In [93]:
len(laptop_rating)

10

In [94]:
df = pd.DataFrame({"Name of Laptop":laptop_title,
                  "Rating": laptop_rating,
                  "Price":laptop_price})
df

                                      Name of Laptop Rating     Price
0  Samsung Galaxy Book2 (NP750) Intel 12th Gen co...    4.0    79,990
1  (Renewed) HP ELITEBOOK 840 G5 (Core i7 8th GEN...    5.0    31,490
2  ASUS ProArt Studiobook 16 OLED (2022) Dial, 16...    4.1  2,38,120
3  LG Gram16 Intel EVO-[12th Gen Core i7/Win11/16...    4.4    82,990
4  ASUS TUF Gaming F15 (2022), 15.6"(39.62 cms) F...    2.0    94,990
5  (Renewed) HP ELITEBOOK 840 G5 (Core i7 8th GEN...    3.0    33,999
6  (Renewed) HP 840g3 Elitebook 14 Inch Screen La...    4.0    31,592
7  ASUS Vivobook S15 OLED 2022, 15.6" 39.62 cms F...    4.1    84,990
8  ASUS TUF Gaming F15 (2022), 15.6" (39.62 cms) ...    4.3    94,990
9  Fujitsu UH-X 11th Gen Intel Core i7 13.3" FHD ...    4.2    89,990

## Q8: Write a python program to scrape data for Top 1000 Quotes of All Time.

In [95]:
driver.get('http://www.azquotes.com/')

In [99]:
quote_tab = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a')
quote_tab.click()

In [100]:
top_quotes = []
top_authors = []
type_of_quotes = []

for page in range(0,10):
    quotes = driver.find_elements(By.XPATH,'//a[@class="wrap-block" or @class="title"]')
    authors = driver.find_elements(By.XPATH,'//div[@class="author"]')
    type_of = driver.find_elements(By.XPATH,'//div[@class="tags"]')
    
    
    for i in quotes:
        top_quotes.append(i.text)
        
    for j in authors:
        top_authors.append(j.text)
        
    for k in type_of:
        type_of_quotes.append(k.text)
        
        
        
    next_button = driver.find_element(By.XPATH,'//li[@class="next"]')
    next_button.click()
    time.sleep(3)

In [101]:
len(top_quotes)

1000

In [102]:
len(top_authors)

1000

In [103]:
len(type_of_quotes)

1000

In [104]:
df = pd.DataFrame({"Quote":top_quotes,
                  "Author":top_authors,
                  "Type Of Quote":type_of_quotes})

df

,Quote,Author,Type Of Quote
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
995,To love means loving the unlovable. To forgive...,Gilbert K. Chesterton,"Love, Inspirational, Success"
996,Be brave. Take risks. Nothing can substitute e...,Paulo Coelho,"Encouraging, Courage, Inspiration"
997,"If you really want to do something, you'll fin...",Jim Rohn,"Inspirational, Motivational, Success"
998,It is neither wealth nor splendor; but tranqui...,Thomas Jefferson,"Life, Happiness, Work"
999,A thousand words will not leave so deep an imp...,Henrik Ibsen,"Inspirational, Inspiring, Positivity"

## Q9: Write a python program to display list of respected former Prime Ministers of India(i.e. Name, Born-Dead, Term of office, Remarks) from https://www.jagranjosh.com/.

In [3]:
driver.get('https://www.jagranjosh.com/')

In [4]:
gkclick= driver.find_element(By.XPATH,'/html/body/div/div[1]/div/div[1]/div/div[5]/div/div[1]/header/div[3]/ul/li[9]/a')
gkclick.click()

In [6]:
prime_click = driver.find_element(By.XPATH,'/html/body/div[1]/div/div/div[2]/div/div[10]/div/div/ul/li[2]/a')
prime_click.click()

In [44]:
prime = driver.find_elements(By.XPATH,'//td[contains(@style, "width: 150px")]')

In [45]:
prime_minister=[]

for i in prime:
    prime_minister.append(i.text)

In [46]:
prime_minister

['Jawahar Lal Nehru',
 'Gulzarilal Nanda (Acting)',
 'Lal Bahadur Shastri',
 'Gulzari Lal Nanda  (Acting)',
 'Indira Gandhi',
 'Morarji Desai',
 'Charan Singh',
 'Indira Gandhi',
 'Rajiv Gandhi',
 'V. P. Singh',
 'Chandra Shekhar',
 'P. V. Narasimha Rao',
 'Atal Bihari Vajpayee',
 'H. D. Deve Gowda',
 'Inder Kumar Gujral',
 'Atal Bihari Vajpayee',
 'Manmohan Singh',
 'Narendra Modi']

In [50]:
born_dead = driver.find_elements(By.XPATH,'//td[contains(@style, "width: 105px")]')

In [51]:
born_dead_of_minister=[]

for i in born_dead:
    born_dead_of_minister.append(i.text)

In [52]:
duration = driver.find_elements(By.XPATH,'//td[contains(@style,"width: 256px")]')

In [62]:
duration_of_minister = []
for i in duration:
    duration_of_minister.append(i.text.replace("\n"," "))

In [63]:
duration_of_minister

['15 August 1947 to 27 May 1964 16 years, 286 days',
 '27 May 1964 to 9 June 1964, 13 days',
 '9 June 1964 to 11 January 1966 1 year, 216 days',
 '11 January 1966 to 24 January 1966 13 days',
 '24 January 1966 to 24 March 1977 11 years, 59 days',
 '24 March 1977 to  28 July 1979  2 year, 126 days',
 '28 July 1979 to 14 January 1980 170 days',
 '14 January 1980 to 31 October 1984 4 years, 291 days',
 '31 October 1984 to 2 December 1989 5 years, 32 days',
 '2 December 1989 to 10 November 1990 343 days',
 '10 November 1990 to 21 June 1991 223 days',
 '21 June 1991 to 16 May 1996 4 years, 330 days',
 '16 May 1996 to 1 June 1996 16 days',
 '1 June 1996 to 21 April 1997 324 days',
 '21 April 1997 to 19 March 1998  332 days',
 '19 March 1998 to 22 May 2004  6 years, 64 days',
 '22 May 2004 to 26 May 2014    10 years, 4 days',
 '26 May 2014 - Present']

In [66]:
remarks = driver.find_elements(By.XPATH,'//td[contains(@style,"width: 145px")]')

In [69]:
remarks_of_minister = []
for i in remarks:
    remarks_of_minister.append(i.text)

In [70]:
remarks_of_minister

['The first prime minister of India and the longest-serving PM of India, the first to die in office.',
 'First acting PM of India',
 "He has given the slogan of 'Jai Jawan Jai Kisan' during the Indo-Pak war of 1965",
 '-',
 'First female Prime Minister of India',
 'Oldest to become PM (81 years old) and first to resign from office',
 'Only PM who did not face the Parliament',
 'The first lady who served as PM for the second term',
 'Youngest to become PM (40 years old)',
 'First PM to step down after a vote of no confidence',
 'He belongs to  Samajwadi Janata Party',
 'First PM from south India',
 'PM for shortest tenure',
 'He belongs to  Janata Dal',
 '------',
 ' The first non-congress PM who completed a full term as PM',
 ' First Sikh PM',
 '4th Prime Minister of India who served two consecutive tenures']

In [54]:
len(prime_minister)

18

In [55]:
len(born_dead_of_minister)

18

In [56]:
len(duration_of_minister)

18

In [71]:
len(remarks_of_minister)

18

In [72]:
df = pd.DataFrame({"Name of Prime Minister": prime_minister,
                  "Born-Dead": born_dead_of_minister,
                  "Term of Office": duration_of_minister,
                  "Remarks":remarks_of_minister})

In [73]:
df

,Name of Prime Minister,Born-Dead,Term of Office,Remarks
0,Jawahar Lal Nehru,(1889–1964),"15 August 1947 to 27 May 1964 16 years, 286 days",The first prime minister of India and the long...
1,Gulzarilal Nanda (Acting),(1898-1998),"27 May 1964 to 9 June 1964, 13 days",First acting PM of India
2,Lal Bahadur Shastri,(1904–1966),"9 June 1964 to 11 January 1966 1 year, 216 days",He has given the slogan of 'Jai Jawan Jai Kisa...
3,Gulzari Lal Nanda (Acting),(1898-1998),11 January 1966 to 24 January 1966 13 days,-
4,Indira Gandhi,(1917–1984),"24 January 1966 to 24 March 1977 11 years, 59 ...",First female Prime Minister of India
5,Morarji Desai,(1896–1995),"24 March 1977 to 28 July 1979 2 year, 126 days",Oldest to become PM (81 years old) and first t...
6,Charan Singh,(1902–1987),28 July 1979 to 14 January 1980 170 days,Only PM who did not face the Parliament
7,Indira Gandhi,(1917–1984),"14 January 1980 to 31 October 1984 4 years, 29...",The first lady who served as PM for the second...
8,Rajiv Gandhi,(1944–1991),"31 October 1984 to 2 December 1989 5 years, 32...",Youngest to become PM (40 years old)
9,V. P. Singh,(1931–2008),2 December 1989 to 10 November 1990 343 days,First PM to step down after a vote of no confi...
10,Chandra Shekhar,(1927–2007),10 November 1990 to 21 June 1991 223 days,He belongs to Samajwadi Janata Party
11,P. V. Narasimha Rao,(1921–2004),"21 June 1991 to 16 May 1996 4 years, 330 days",First PM from south India
12,Atal Bihari Vajpayee,(1924- 2018),16 May 1996 to 1 June 1996 16 days,PM for shortest tenure
13,H. D. Deve Gowda,(born 1933),1 June 1996 to 21 April 1997 324 days,He belongs to Janata Dal
14,Inder Kumar Gujral,(1919–2012),21 April 1997 to 19 March 1998 332 days,------
15,Atal Bihari Vajpayee,(1924-2018),"19 March 1998 to 22 May 2004 6 years, 64 days",The first non-congress PM who completed a ful...
16,Manmohan Singh,(born 1932),"22 May 2004 to 26 May 2014 10 years, 4 days",First Sikh PM
17,Narendra Modi,(born 1950),26 May 2014 - Present,4th Prime Minister of India who served two con...

## Q10: Write a python program to display list of 50 Most expensive cars in the world (i.e. Car name and Price) from https://www.motor1.com/

In [74]:
driver.get('https://www.motor1.com/')

In [76]:
list_button = driver.find_element(By.CLASS_NAME,'m1-hamburger-button')
list_button.click()

In [77]:
features = driver.find_element(By.XPATH,'/html/body/div[4]/div[1]/div[3]/ul/li[5]/a')
features.click()

In [79]:
view_more = driver.find_element(By.XPATH,'/html/body/div[3]/div[6]/div/div[1]/div[2]/a')
view_more.click()

In [80]:
expensive_tab = driver.find_element(By.XPATH,'/html/body/div[3]/div[8]/div[1]/div[1]/div/div/div[8]/div/div[1]/a')
expensive_tab.click()

In [81]:
cars_list = driver.find_elements(By.XPATH,'//h3[@class="subheader"]')

In [82]:
car_name = []
for i in cars_list[0:50]:
    car_name.append(i.text)

In [85]:
len(car_name)

50

In [91]:
price_list = driver.find_elements(By.XPATH,'//p[strong]')

In [106]:
car_price = []
for i in price_list:
    if "$" in i.text:
        car_price.append(i.text)

In [109]:
car_price

['Price: $1.3 Million',
 'Price: $1.4 Million',
 'Price: $1.4 Million',
 'Inarguably one of the prettiest cars on this list, the Pagani Huayra cost a cool $1.4 million when new. Like the LaFerrari, Pagani built the Huayra in extremely limited numbers. The company hand-constructed just 100 units of the coupe between 2012 and 2018, with another 20 versions of the BC model (which makes our list further down) between 2017 and 2019. Powering each and every example was a Mercedes-AMG V12 capable of 720 horsepower (537 kilowatts).',
 'Price: $1.7 Million',
 'Price: $1.7 Million',
 'Price: $1.7 Million',
 'Price: $1.7 Million',
 'Price: $1.7 Million',
 'Price: $1.7 Million',
 'Price: $1.8 Million',
 'Price: $1.9 Million',
 'Price: $1.9 Million',
 'Price: $2.0 Million',
 'Price: $2.0 Million',
 'Price: $2.0 Million*',
 'Price: $2.1 Million',
 'Price: $2.3 Million',
 'Price: $2.3 Million',
 'Price: $2.3 Million',
 'Price: $2.4 Million',
 'Price: $2.5 Million',
 'Price: $2.5 Million',
 'Price: $2.6 Million',
 'Price: $2.6 Million',
 'Price: $2.6 Million',
 'Price: $2.7 Million',
 'Price: $3.0 Million',
 '$3.0 Million',
 'Price: $3.0 Million',
 'Price: $3.2 Million',
 'Price: $3.4 Million',
 '$3.5 Million',
 'Price: $3.5 Million',
 'Price: $3.6 Million',
 'Price: $3.6 million',
 'Price: $3.7 Million',
 'Price: $3.9 Million',
 'Price: $4.5 Million',
 'Price: $4.7 Million',
 'Price: $5.0 Million',
 'Price: $5.4 Million',
 'Price: $5.8 Million',
 'Price: $6.4 Million',
 'Price: $7.4 Million',
 'Price: $8.0 Million',
 'Price: $9.0 Million',
 'Price: $10.8 Million',
 'Price: $12.8 Million',
 'Price: $13.4 Million',
 'Price: $28.0 Million (est.)']

In [112]:
del car_price[3]

In [114]:
len(car_price)

50

In [116]:
df = pd.DataFrame({"Car Name" :car_name,
                  "Car_Price":car_price})

In [117]:
df

                           Car Name                    Car_Price
0                     De Tomaso P72          Price: $1.3 Million
1                 Ferrari LaFerrari          Price: $1.4 Million
2                     Pagani Huayra          Price: $1.4 Million
3                      McLaren Elva          Price: $1.7 Million
4                       Czinger 21C          Price: $1.7 Million
5                     Ferrari Monza          Price: $1.7 Million
6                Gordon Murray T.33          Price: $1.7 Million
7                 Koenigsegg Gemera          Price: $1.7 Million
8                       Zenvo TSR-S          Price: $1.7 Million
9                Hennessey Venom F5          Price: $1.8 Million
10                  Bentley Bacalar          Price: $1.9 Million
11    Hispano Suiza Carmen Boulogne          Price: $1.9 Million
12           Bentley Mulliner Batur          Price: $2.0 Million
13                     Deus Vayanne          Price: $2.0 Million
14                      SSC Tuatara         Price: $2.0 Million*
15                      Lotus Evija          Price: $2.1 Million
16              Aston Martin Vulcan          Price: $2.3 Million
17                       Delage D12          Price: $2.3 Million
18                McLaren Speedtail          Price: $2.3 Million
19                     Rimac Nevera          Price: $2.4 Million
20                    Pagani Utopia          Price: $2.5 Million
21             Pininfarina Battista          Price: $2.5 Million
22                Ferrari FXX K Evo          Price: $2.6 Million
23               Gordon Murray T.50          Price: $2.6 Million
24             Lamborghini Countach          Price: $2.6 Million
25         Mercedes-AMG Project One          Price: $2.7 Million
26              Aston Martin Victor          Price: $3.0 Million
27      Hennessey Venom F5 Roadster                 $3.0 Million
28                 Koenigsegg Jesko          Price: $3.0 Million
29            Aston Martin Valkyrie          Price: $3.2 Million
30        W Motors Lykan Hypersport          Price: $3.4 Million
31                    McLaren Solus                 $3.5 Million
32        Pagani Huayra Roadster BC          Price: $3.5 Million
33         Bugatti Chiron Pur Sport          Price: $3.6 Million
34                 Lamborghini Sian          Price: $3.6 million
35                 Koenigsegg CC850          Price: $3.7 Million
36  Bugatti Chiron Super Sport 300+          Price: $3.9 Million
37               Lamborghini Veneno          Price: $4.5 Million
38                   Bugatti Bolide          Price: $4.7 Million
39                  Bugatti Mistral          Price: $5.0 Million
40              Pagani Huayra Imola          Price: $5.4 Million
41                     Bugatti Divo          Price: $5.8 Million
42              SP Automotive Chaos          Price: $6.4 Million
43                 Pagani Codalunga          Price: $7.4 Million
44         Mercedes-Maybach Exelero          Price: $8.0 Million
45               Bugatti Centodieci          Price: $9.0 Million
46          Bugatti Chiron Profilée         Price: $10.8 Million
47             Rolls-Royce Sweptail         Price: $12.8 Million
48         Bugatti La Voiture Noire         Price: $13.4 Million
49           Rolls-Royce Boat Tail*  Price: $28.0 Million (est.)